In [2]:
import pandas as pd
import numpy as np

In [85]:
dataset = {"İsim" : ["Murat", "Aslı", "Mehmet", "Mert"],
          "Soyad" : ["Sakal", "Sakal", "Mavi", "Noyan"],
          "Yaş" : [45,37, "bilinmiyor", 37],
          "Şehir" : ["Muğla", "Muğla", np.nan, "İzmir"],
          "Ülke": ["Türkiye","Türkiye","Türkiye","Türkiye"],
          "GANO" : [np.nan, np.nan, 3.9, np.nan]}

In [94]:
df = pd.DataFrame(dataset)

In [95]:
df

     İsim  Soyad         Yaş  Şehir     Ülke  GANO
0   Murat  Sakal          45  Muğla  Türkiye   NaN
1    Aslı  Sakal          37  Muğla  Türkiye   NaN
2  Mehmet   Mavi  bilinmiyor    NaN  Türkiye   3.9
3    Mert  Noyan          37  İzmir  Türkiye   NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   İsim    4 non-null      object
 1   Soyad   4 non-null      object
 2   Yaş     4 non-null      object
 3   Şehir   3 non-null      object
 4   Ülke    4 non-null      object
 5   GANO    1 non-null      float64
dtypes: float64(1), object(5)
memory usage: 320.0+ bytes

In [7]:
df.isna().sum().sum() #boş değerlerinin toplamını verir. isna ise true false olarak boş yerleri gösterir

4

In [66]:
df.dropna(axis=1, how="any", thresh=3)

     İsim  Soyad         Yaş  Şehir     Ülke
0   Murat  Sakal          45  Muğla  Türkiye
1    Aslı  Sakal          37  Muğla  Türkiye
2  Mehmet   Mavi  bilinmiyor    NaN  Türkiye
3    Mert  Noyan          22  İzmir  Türkiye

In [67]:
df.drop(labels=["GANO"],axis=1)

     İsim  Soyad         Yaş  Şehir     Ülke
0   Murat  Sakal          45  Muğla  Türkiye
1    Aslı  Sakal          37  Muğla  Türkiye
2  Mehmet   Mavi  bilinmiyor    NaN  Türkiye
3    Mert  Noyan          22  İzmir  Türkiye

In [100]:
df_2=df.copy()

In [101]:
df_2.drop(labels=["GANO"],axis=1)

     İsim  Soyad         Yaş  Şehir     Ülke
0   Murat  Sakal          45  Muğla  Türkiye
1    Aslı  Sakal          37  Muğla  Türkiye
2  Mehmet   Mavi  bilinmiyor    NaN  Türkiye
3    Mert  Noyan          37  İzmir  Türkiye

In [102]:
df_2 = df.drop(labels=["GANO", "Ülke"], axis=1)

In [103]:
df_2

     İsim  Soyad         Yaş  Şehir
0   Murat  Sakal          45  Muğla
1    Aslı  Sakal          37  Muğla
2  Mehmet   Mavi  bilinmiyor    NaN
3    Mert  Noyan          37  İzmir

In [104]:
df_2["Yaş"].replace("bilinmiyor", np.nan, inplace=True)

In [105]:
df_2

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0  Muğla
1    Aslı  Sakal  37.0  Muğla
2  Mehmet   Mavi   NaN    NaN
3    Mert  Noyan  37.0  İzmir

In [81]:
df_2["Yaş"].mean()

31.5

In [53]:
import numpy as np
from sklearn.impute import SimpleImputer

In [106]:
imp_freq = SimpleImputer(missing_values=np.nan, strategy="most_frequent")

In [107]:
df_2["Yaş"] = imp_freq.fit_transform(df_2[["Yaş"]])

In [109]:
df_2

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0  Muğla
1    Aslı  Sakal  37.0  Muğla
2  Mehmet   Mavi  37.0    NaN
3    Mert  Noyan  37.0  İzmir

In [ ]:
df_2["Şehir"].replace("bilinmiyor", np.nan, inplace=True)